## Dependency Installation

In [96]:
import mysql.connector
import pandas as pd
import matplotlib.pyplot as plt

## Database Connectivity

In [97]:
def mysqlConnector(table, database = "foodhunter"):
    try:
        connection = mysql.connector.connect(host = "localhost", user = "root", password = "root")
        cur = connection.cursor()
        cur.execute(f"SELECT * FROM foodhunter.{table}")
        data = cur.fetchall()
        columns = [meta[0] for meta in cur.description]
    except Exception as e:
        print("> Error Occured : ", e)
    else:
        print("> Connection Successful!")
    finally:
        return data, columns
        connection.close()

In [98]:
data, columns = mysqlConnector("orders")
orders = pd.DataFrame(data, columns = columns)

data, columns = mysqlConnector("customers")
customers = pd.DataFrame(data, columns = columns)

data, columns = mysqlConnector("orders_items")
orders_items = pd.DataFrame(data, columns = columns)

data, columns = mysqlConnector("drivers")
drivers = pd.DataFrame(data, columns = columns)

data, columns = mysqlConnector("food_items")
fooditems = pd.DataFrame(data, columns = columns)

data, columns = mysqlConnector("restaurants")
restaurants = pd.DataFrame(data, columns = columns)

> Connection Successful!
> Connection Successful!
> Connection Successful!
> Connection Successful!
> Connection Successful!
> Connection Successful!

## Table Exploration

### Orders

In [99]:
orders.head()

,order_id,customer_id,order_date,order_time,delivered_date,delivered_time,delivery_address,driver_id,total_price,delivery_fee,discount,final_price,order_rating
0,1,7420,2022-06-01,0 days 00:03:00,2022-06-01,0 days 00:16:00,7 Cedar Lane,93,150,0.0,30.0,120.0,3.555464
1,2,1895,2022-06-01,0 days 00:04:00,2022-06-01,0 days 00:18:00,7 Lexington Place,138,9,5.0,0.0,14.0,5.000000
2,3,6651,2022-06-01,0 days 00:05:00,2022-06-01,0 days 00:20:00,20 Linden Lane,187,117,0.0,23.4,93.6,3.393489
3,4,9032,2022-06-01,0 days 00:05:00,2022-06-01,0 days 00:24:00,6 Rosedale Avenue,10,105,0.0,21.0,84.0,5.000000
4,5,2479,2022-06-01,0 days 00:06:00,2022-06-01,0 days 00:34:00,36 Cherrywood Lane,219,27,2.5,5.4,24.1,3.793048

In [100]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43118 entries, 0 to 43117
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          43118 non-null  int64
 1   customer_id       43118 non-null  int64
 2   order_date        43118 non-null  datetime64[ns]
 3   order_time        43118 non-null  timedelta64[ns]
 4   delivered_date    43118 non-null  object
 5   delivered_time    43118 non-null  timedelta64[ns]
 6   delivery_address  43118 non-null  object
 7   driver_id         43118 non-null  int64
 8   total_price       43118 non-null  int64
 9   delivery_fee      43118 non-null  float64
 10  discount          43118 non-null  float64
 11  final_price       43118 non-null  float64
 12  order_rating      43118 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(4), object(2), timedelta64[ns](2)
memory usage: 4.3+ MB

In [103]:
orders['delivered_date'] = pd.to_datetime(orders.delivered_date, format = '%Y-%m-%d')

In [104]:
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 43118 entries, 0 to 43117
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   order_id          43118 non-null  int64
 1   customer_id       43118 non-null  int64
 2   order_date        43118 non-null  datetime64[ns]
 3   order_time        43118 non-null  timedelta64[ns]
 4   delivered_date    43118 non-null  datetime64[ns]
 5   delivered_time    43118 non-null  timedelta64[ns]
 6   delivery_address  43118 non-null  object
 7   driver_id         43118 non-null  int64
 8   total_price       43118 non-null  int64
 9   delivery_fee      43118 non-null  float64
 10  discount          43118 non-null  float64
 11  final_price       43118 non-null  float64
 12  order_rating      43118 non-null  float64
dtypes: datetime64[ns](2), float64(4), int64(4), object(1), timedelta64[ns](2)
memory usage: 4.3+ MB

### Customers

In [105]:
customers.head()

   customer_id first_name  last_name phone_number             address
0            1     Donald      Arend   9020474801   49 Madison Avenue
1            2    Richard      Krick   7040231632   32 Vineyard Drive
2            3    Pauline    Hardman   9180289990    18 Elmwood Place
3            4   Lawrence    Sultzer   8278748624  77 Rosedale Avenue
4            5    Michael  Honeycutt   8821565245     56 Broad Street

In [108]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   customer_id   10000 non-null  int64
 1   first_name    10000 non-null  object
 2   last_name     9191 non-null   object
 3   phone_number  10000 non-null  object
 4   address       10000 non-null  object
dtypes: int64(1), object(4)
memory usage: 390.8+ KB

In [117]:
customers[customers.isna().any(axis = 1)][:5]

    customer_id first_name last_name phone_number              address
10           11    Cynthia      None   8159251692  71 Sunnyside Avenue
17           18     Aurora      None   8949401769        73 Cedar Road
19           20   Georgina      None   8522173583      13 Holly Avenue
40           41       Ruth      None   6827925206    62 Hillcrest Road
58           59     Joshua      None   7411561076           37 Magnoli

### orders_items

In [106]:
orders_items.head()

   order_id  item_id  quantity
0         1      176         3
1         2      108         1
2         3      339         3
3         4      380         1
4         4      108         1

In [119]:
orders_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 64727 entries, 0 to 64726
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  64727 non-null  int64
 1   item_id   64727 non-null  int64
 2   quantity  64727 non-null  int64
dtypes: int64(3)
memory usage: 1.5 MB

### drivers

In [120]:
drivers[:5]

   driver_id            name  rating
0          1      Avery Yost     3.1
1          2  Anthony Pegram     4.3
2          3    Elaine Kimes     4.2
3          4      Julie West     3.7
4          5     Jamie Hyman     4.3

In [121]:
drivers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   driver_id  250 non-null    int64
 1   name       250 non-null    object
 2   rating     229 non-null    float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.0+ KB

### fooditems

In [122]:
fooditems.head()

   item_id  restaurant_id          item_name food_type price  calories
0      101             47  Coconut Ice Cream       Veg  None     500.0
1      102             93  Vegetable Pakoras       Veg  None    1000.0
2      103             24        Wonton soup   Non-Veg  None     400.0
3      104             23       Spring rolls   Non-Veg  None     500.0
4      105             77           Chinotto       Veg  None     500.0

In [123]:
fooditems.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 314 entries, 0 to 313
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_id        314 non-null    int64
 1   restaurant_id  314 non-null    int64
 2   item_name      314 non-null    object
 3   food_type      314 non-null    object
 4   price          0 non-null      object
 5   calories       291 non-null    float64
dtypes: float64(1), int64(2), object(3)
memory usage: 14.8+ KB

### restaurants

In [124]:
restaurants.head()

   restaurant_id restaurant_name  cuisine        address
0              1        L'Artusi  Italian  "3540 7th Ave
1              2    Loring Place  Chinese  "6947 4th Ave
2              3      Café China  Chinese  "9675 7th Ave
3              4  Minetta Tavern     Thai   "609 2nd Ave
4              5         Carbone  Chinese   "871 8th Ave

In [125]:
restaurants.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   restaurant_id    100 non-null    int64
 1   restaurant_name  100 non-null    object
 2   cuisine          100 non-null    object
 3   address          100 non-null    object
dtypes: int64(1), object(3)
memory usage: 3.3+ KB

## Causual Inference